---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Schema.ReadAccessLevel
source: html/784a6bed-58cb-d3e2-84ea-971863f1ae37.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.ReadAccessLevel Property

Read access level of the schema.

## Syntax (C#)
```csharp
public AccessLevel ReadAccessLevel { get; }
```